PerfomanceTest/stress-register.yml
config:
  target: "http://localhost:8000/api/v1"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50 # Empezamos con 5 usuarios/seg y aumentamos a 50
  payload:
    # Genera datos aleatorios para cada usuario
    path: "users.csv"
    fields:
      - "name"
      - "email"
      - "password"
scenarios:
  - name: "Register New Users"
    flow:
      - post:
          url: "/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
            password_confirmation: "{{ password }}"